{
  "</analyze>": 50303,
  "</answer>": 50307,
  "</auditory_input>": 50271,
  "</auditory_output>": 50277,
  "</evaluate>": 50267,
  "</internal_thinking>": 50261,
  "</plan>": 50265,
  "</reasoning>": 50263,
  "</s>": 50259,
  "</step>": 50305,
  "</tactile_input>": 50273,
  "</tactile_output>": 50279,
  "</think>": 50286,
  "</tool_call>": 50295,
  "</visual_input>": 50269,
  "</visual_output>": 50275,
  "<analyze>": 50302,
  "<answer>": 50306,
  "<auditory_input>": 50270,
  "<auditory_output>": 50276,
  "<evaluate>": 50266,
  "<internal_thinking>": 50260,
  "<pad>": 50257,
  "<plan>": 50264,
  "<reasoning>": 50262,
  "<s>": 50258,
  "<step>": 50304,
  "<tactile_input>": 50272,
  "<tactile_output>": 50278,
  "<think>": 50285,
  "<tool_call>": 50294,
  "<visual_input>": 50268,
  "<visual_output>": 50274,
  "<|EOT|>": 50284,
  "<|file_sep|>": 50301,
  "<|fim_middle|>": 50297,
  "<|fim_pad|>": 50299,
  "<|fim_prefix|>": 50296,
  "<|fim_suffix|>": 50298,
  "<|image_pad|>": 50292,
  "<|quad_end|>": 50288,
  "<|quad_start|>": 50287,
  "<|repo_name|>": 50300,
  "<|video_pad|>": 50293,
  "<|vision_end|>": 50290,
  "<|vision_pad|>": 50291,
  "<|vision_start|>": 50289,
  "<｜Assistant｜>": 50282,
  "<｜User｜>": 50281,
  "<｜begin▁of▁sentence｜>": 50283,
  "<｜end▁of▁sentence｜>": 50280
}
